templatedir/nice/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    /*
    inlet
    {
        type            fixedValue;
        value           uniform 100000;
    }

    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.3;
        fieldInf        100000;
        lInf            1;
        value           uniform 100000;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    topWall
    {
        type            zeroGradient;
    }

    prismWall
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
    */
    
    
    minY
    {
        type            empty;
    }
    maxY
    {
        type            zeroGradient;
    }
    theWalls
    {
        type            zeroGradient;
    }
    minX
    {
        type            zeroGradient;
    }
    maxX
    {
        type            waveTransmissive;
        value           uniform 101325;
        field           p;
        gamma           1.3271193649;
        phi             sigmaDotU;
        rho             rho;
        psi             thermo:psi_0;//rPsi
        lInf            0.01;
        fieldInf        101325;
    }
    minZ
    {
        type            wedge;//wedge;
    }
    maxZ
    {
        type            wedge;//wedge;
    }
    /*defaultFaces
    {
        type        empty;
    }*/
    
}

// ************************************************************************* //
