templatedir/nice/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3800000;

boundaryField
{
    /*
    inlet
    {
        type            fixedValue;
        value           uniform 266000;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 266000;
        value           uniform 266000;
    }
    bottomWall
    {
        type            inletOutlet;
        inletValue      uniform 266000;
        value           uniform 266000;
    }
    topWall
    {
        type            inletOutlet;
        inletValue      uniform 266000;
        value           uniform 266000;
    }
    prismWall
    {
        type            epsilonWallFunction;
        value           uniform 266000;
    }
    defaultFaces
    {
        type            empty;
    }
    */
    
    minY
    {
        type            empty;
    }
    maxY
    {
        type            fixedValue;
        value           uniform 100000;
    }
    theWalls
    {
        type           epsilonWallFunction;
        value           uniform 100000;
    }
    minX
    {
        type            fixedValue;
        value           uniform 100000;
    }
    maxX
    {
        type            advective;
        phi             phi;
    }
    minZ
    {
        type           wedge;//wedge;
    }
    maxZ
    {
        type           wedge;//wedge;
    }
    /*defaultFaces
    {
        type        empty;
    }*/
    
}


// ************************************************************************* //
