templatedir/nice/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
kInlet          1e-8;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    /*
    inlet
    {
        type            fixedValue;
        value           uniform 1000;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    bottomWall
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    topWall
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
    prismWall
    {
        type            kqRWallFunction;
        value           uniform 1000;
    }
    defaultFaces
    {
        type            empty;
    }
    */
    
    minY
    {
        type            empty;
    }
    maxY
    {
        type fixedValue;
        value uniform $kInlet;
    }
    theWalls
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }
    minX
    {
        type fixedValue;
        value uniform $kInlet;
    }
    maxX
    {
        type waveTransmissive;
        value uniform $kInlet;
        gamma 1.3271193649;
        //type            zeroGradient;
    }
    minZ
    {
        type           wedge;//wedge;
    }
    maxZ
    {
        type           wedge;//wedge;
    }
    /*defaultFaces
    {
        type        empty;
    }*/
}


// ************************************************************************* //
