templatedir/nice/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
omegaInlet      1;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    /*
    inlet
    {
        type            fixedValue;
        value           uniform 266000;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 266000;
        value           uniform 266000;
    }
    bottomWall
    {
        type            inletOutlet;
        inletValue      uniform 266000;
        value           uniform 266000;
    }
    topWall
    {
        type            inletOutlet;
        inletValue      uniform 266000;
        value           uniform 266000;
    }
    prismWall
    {
        type            epsilonWallFunction;
        value           uniform 266000;
    }
    defaultFaces
    {
        type            empty;
    }
    */
    
    minY
    {
        type            empty;
    }
    maxY
    {
        type fixedValue;
        value uniform $omegaInlet;
    }
    theWalls
    {
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }
    minX
    {
        type fixedValue;
        value uniform $omegaInlet;
    }
    maxX
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField;
    }
    minZ
    {
        type           wedge;//wedge;
    }
    maxZ
    {
        type           wedge;//wedge;
    }
    /*defaultFaces
    {
        type        empty;
    }*/
    
}


// ************************************************************************* //
