templatedir/nice/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    
"(rho|rhoU|rhoE)"
{
solver diagonal;
}

U
{
    solver smoothSolver;
    smoother GaussSeidel;
    nSweeps 2;
    tolerance 1e-09;
    relTol 0;
}

h
{
$U;
tolerance 1e-10;
relTol 0;
}

e
{
$U;
tolerance 1e-10;
relTol 0;
}

omega
{
$U;
tolerance 1e-10;
relTol 0;
}

k
{
$U;
tolerance 1e-10;
relTol 0;
}


/*
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }
    
    p
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|omega|e)Final"
    {
        $U;
        relTol          0;
    }*/
}

SIMPLE
{
    //consistent      yes;
    residualControl
    {
        p               1e-6;
        U               1e-6;
        "(k|omega|e)"   1e-6;
    }

    nNonOrthogonalCorrectors 4;
    pMinFactor      0.1;
    pMaxFactor      2;
}

PIMPLE
{
    nCorrectors              2;
    nNonOrthogonalCorrectors 4;
    nOuterCorrectors         4;
    pMinFactor      0.1;
    pMaxFactor      2;
    transonic true;
    nAlphaCorr      2;
    nAlphaSubCycles 4;
}

relaxationFactors
{
    equations
    {
        "U.*"           0.9;
        "k.*"           0.9;
        "epsilon.*"     0.9;
    }
    fields
    {
        p 0.3;
        rho 0.7;
    }
}

// ************************************************************************* //
