templatedir/nice/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    theWalls
    {
        type        wall;
    }
    /*maxZ
    {
        type        wedge;
    }
    minZ
    {
        type        wedge;
    }
    defaultFaces
    {
        type        empty;
    }*/
}


/*
boundaryField
{
    theWalls
    {
        type        empty;
    }
}
*/

// ************************************************************************* //
